[
  {
    "memory": "",
    "age": 62,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 60,
    "score": 3,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 72,
    "score": 4,
    "flashbulb": "FALSE"
  },
  {
    "memory": "In my family (Italian) Christmas and New Years is family get together time. All in one house -- for the Eve and the Day (grown-ups and kids). Women -- cook & talk, men -- play cards & talk (poker), kids -- play games & T.V.",
    "age": 82,
    "score": 10,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 80,
    "score": 8,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 84,
    "score": 4,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 63,
    "score": 10,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 57,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 72,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 82,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 75,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 84,
    "score": 4,
    "flashbulb": "FALSE"
  },
  {
    "memory": "It was fairly uneventful, just stayed at home with my Mom and sister waiting for the ball to drop.  I don't really remember much else besides the fact that lots of people were worried about the Y2K bug, heh.  I wasn't, though.",
    "age": 30,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "Small group of friends had a party and snacks and watched Dick Clark ring in the new year",
    "age": 38,
    "score": 8,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was still pretty young. It was in my living room with my parents and sister. We ordered a whole bunch of Chinese food and played board games. The whole time Dick Clark's New Year's Rockin Eve was playing in the background. I don't remember what I was wearing exactly but me and my sister both had on these big goofy ass hats. They looked like the kind the Cat in the Hat wore but they were different colors.",
    "age": 28,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was in fifth grade and not looking forward to school starting up in a few days. Aside from that, not much",
    "age": 26,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I really don't remember much. I was pretty young. I don't even think I stayed up past midnight. It was pretty uneventful.",
    "age": 28,
    "score": 1,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was at home with family and we had our own family party. We watched the countdown and threw confetti. We drank champagne and ate shrimp cocktail.",
    "age": 27,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at a church dance with my friends.  I was 17 at the time, and we were just having fun, dancing and eating snacks.  At midnight, someone turned out all the lights to play a joke.  Nobody was really worried about anything and we all just thought it was funny.  That's really all I can remember that was memorable at all.",
    "age": 33,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at a party with friends and my boyfriend.  We had a great time ringing in the new year.",
    "age": 36,
    "score": 7,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was in my barracks room. Someone knocked on it and said they were inviting people to go downtown to see the fireworks so no one would be alone on New Years of the new millennium.  I thanked him, but declined his invitation. I spent the new year by myself watching it on the small television I had.",
    "age": 40,
    "score": 7,
    "flashbulb": "TRUE"
  },
  {
    "memory": "We were out of town for a college bowl game and we were sitting around in a hotel room waiting for everything to go black when the clocks rolled over to January 1, 2000.",
    "age": 37,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was 15 when I celebrated New Year's Eve 19969. So, I spent it at home with my family. My parent's bought sparkling cider for my sister, brother, and myself. We watched the ball drop on tv and went to sleep.",
    "age": 32,
    "score": 8,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at work in the prison as a correction officer",
    "age": 50,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "We were in high school. I remember being at Ryan's house in his basement. It was a small gathering. The boy I liked was there. He tickled me. I remember watching Conan.",
    "age": 32,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at a party with my family and friends.  We counted down to the new year.  It was excite because it was the year 2000.",
    "age": 39,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was actually still quite young when New Year's Eve 1999 rolled around. I remember that New Year's in particular because there was a lot of fear-mongering going on at the time about the Y2K bug and computer systems not being able to handle the sudden change from the 1900s into the 2000s and that chaos was to ensue once the New Year rolled it. All the \"hype\" was quite silly now that I think about it. Several countries celebrated the New Year hours ahead of the U.S., and they had no issues. I recall staying up late at night, not to watch the ball drop or anything like that, but to watch a television show that I really liked at the time. Since I was still a teenager, I had a lot of free time and binge watching shows was my thing.",
    "age": 30,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was in my room alone on the computer, I am pretty sure I was in a AOL chat room talking with friends I had made online. My mother and brother were both drinking alcohol in the living room. I remember many people being concerned about Y2K and I remember how it was common joke fodder for the late night talk shows. I remember news reports about people buying months of goods and supplies in the event of catastrophe.",
    "age": 30,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I lived in Munich, Germany. My best friend from childhood and I (both from CT) were exchange students in high school. She married and moved to Munich and I studied German for years and moved there to be closer to her and to enjoy the culture/perfect my spoken German. We were at her apartment, possibly with a few other friends, enjoying the local beer and I remember us watching a famous TV show that they play every year and we watched the Prince 1999 video. At midnight, I always like to open the champagne and pour it into my flute glasses. At midnight, the whole city shoots off fireworks! We ran between both ends of her place standing out on the balconies and watching the amazing fireworks all over the neighborhood! I, as I did every year, called my mom so she could hear them. :)",
    "age": 53,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember being at a neighbor's house in our cul-de-sac. Several of the neighbors were there, including my two friends from the neighborhood, and our parents. I remember specifically my mother being happy and charming, because she passed away not long afterwards. I remember the adults drinking, and the kids having lots of treats and candy. This is also the first year I remember the glasses with the numbers of the year on them, as the zeros were good for eyeholes. At midnight, we celebrated together, and I believe someone had confetti.",
    "age": 27,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember everyone waiting with anticipation to see what would happen when the clocks rolled over to midnight. Being Y2K I remember there being a lot of curiosity and apprehension about what may happen as the year 2000 came around. I don't remember being afraid, or adults around me being scared, but I remember there being a lot of media and suggestions to back up computers prior the midnight.If I had to describe the evening I would say waiting and anticipating.",
    "age": 26,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was working at a restaurant. It was a terrible experience. The place was packed the entire night, and I did not get home until about 3 in the morning. I definitely do not ever want to through that again.",
    "age": 28,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "So, on New Years Eve 1999 I was like 10 years old, and I remember I was in this apartment in Denver (it was our apartment that we rented), and we had just like moved to Colorado about 6 months or so before that. And anyways, I was just with my parents (my mom and dad), and I remember they were very excited about it and they were celebrating and everything. My mom always decorated for New Years Eve, and they watched the countdown in Times Square etc.. So, I remember like where I was and who I was with, but beyond that my memory is pretty vague. I don't remember much else besides that.",
    "age": 27,
    "score": 8,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I had a quiet celebration at home with my neighbor at that time.",
    "age": 62,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "We had a party at our apartment. Lots of food, lots of drinks and good company. We videotaped our party and different people spoke on camera.",
    "age": 38,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 20,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was at a classmate's house with a few other of my classmates. We were sophomores in high school. My high school crush was also there & I wanted to kiss him at midnight but all I got was a kiss on the cheek.",
    "age": 32,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember being at my close friend's house where her older siblings were having a party. I remember wearing jeans that I was super excited about and boots too. Overall, it was a very memorable experience and one I wish I could relive.",
    "age": 27,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 68,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I remember everyone being pleasantly excited and thankful for having each other in their lives. I remember there being plenty of pleasant food and drinks. I also remember feeling extremely happy for having such a good year. It was very loud in my home that night and everyone laughing and enjoying themselves. What I really remember was my relative proposing to his wife that night.",
    "age": 38,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was sitting in the family room with my mom step dad siblings and step siblings there were 8 of us all together. We were in Utah watching tv together of the fireworks from around the world.",
    "age": 28,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I recall that my husband and I went to Longhorn and brought back some ribs for our kids. We all ate together at the dinner table, and then we started preparing desert. We played games until it got close to midnight, and then we turned on the television to watch the ball drop. We drank sparkling cider when it went down to 0, and then ate some desert and watched the fireworks.",
    "age": 54,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember being at home with my mother and my siblings. I think my mother was watching a late night talk show or the ball drop on TV. I felt nervous as midnight approached because people were afraid of the Y2K bug and various things happening when 2000 hit. I felt a feeling of relief but boredom when nothing happened.",
    "age": 28,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "On new years eve I was at church with friends and family. We were all together, standing, hands lifted in prayer. As the clock struck we continued to pray as we did not know what was going to happen at midnight, but if it was the end of the world, we wanted to leave the correct way.",
    "age": 32,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was 16. I remember watching the ball drop just to see if everything would go crazy when 2000 hit, but I didn't expect it.",
    "age": 33,
    "score": 4,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at a house party.  It was exciting, just like any other New Year's Eve though.   Someone killed all the power in the house at the ball drop though, which got lots of laughs and screams.",
    "age": 36,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I enjoyed the firework celebrations around the world. I had hopes for a new century of peace.",
    "age": 36,
    "score": 9,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was only 12 so I wasn't at a party or anything. I was with my older sister watching TV in our living room. I had heard all about the Y2K stuff so we were like \"is everything going to break!?\" we were glued to the screen. Then the clock hit 12 and nothing special happened. We were actually a little bummed out by that.",
    "age": 29,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "The thing I really remember is that Will Smith song Willenium and that Backstreet Boys album playing I think. I remember I was scared because of Y2K and I thought it was the biblical endtimes so I was pretty stressed, even as a 9 year old.",
    "age": 26,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was in nyc downtown on 42nd street. I went there with friends, and some coworkers. We were standing close to the ball when it dropped. There were people next to us who was kind of scared that something would happen. I think they were waiting on Y2k, and they were from out of town. There were a lot of police down there that night. I was excited because I didn't have to work that night, so I could enjoy myself. After the ball drop we planned on going to a club in the meatpacking district. We had been drinking before going out, so we were acting really silly, and I was in a very playful mood. There were so many people down there, and it was loud. When the countdown began it got so loud, it felt like my ears were ringing. We did the countdown with everyone else, then hugged and kissed each other on the cheeks when the new year came in. We stayed down there for a while, just partying in the streets. Then went to the club. We stayed there for the rest of the night, dancing, and drinking.",
    "age": 40,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "My grandparents and I were watching Dick Clarks New Year's Eve. We were nervous and a little concerned about Y2K.",
    "age": 32,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 25,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I spent New Year's Eve 1999 with a girlfriend. We spent some time that evening with her parents and some of her siblings were there. Later on we went to a party with some friends to bring in the New Year. We stayed at the party until a few hours after midnight. We then went to a cafe to get something to eat and later we went back to her home.",
    "age": 30,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "My parents had gone nuts for several years about y2k and churches that were preaching the apocalypse and rapture and stuff. I hated it. I went to bed in protest early that night and didn't stay up. I thought if they were right and it was the end of the world I might as well be unconscious.",
    "age": 32,
    "score": 9,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was with my family which at the time consisted of my brother, mother, and my father.  We went to a family friend's house who was having a more family oriented New Years Eve Party with the College Football on and some other activities for children.  I remember some people joking about how the electronics were going to stop functioning and others joking about how the world is going to end.  Once Dick Clark did his thing and the ball dropped everyone yelled and screamed while couples shared a quick kiss.  After that the party winded down and my family went home.",
    "age": 31,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember being with family. We had a big dinner and spent time together.",
    "age": 25,
    "score": 6,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I believe I'd had kind of a bad week and I was kind of nervous about Y2K and ended up just going to bed early. I recall looking at the clock around midnight and then just going back to bed. I remember it so well because it's the first New Years Eve I've ever gone to bed early. But I recall hearing my parents in the living room watching the New Years Eve parties on tv.",
    "age": 34,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I can remember being at a party at a friends house.  We had food and drinks and were dancing and listening to music. We were chatting and joking about Y2K and what would happen after midnight. I remember thinking nothing would happen and then when nothing did happen I was satisfied.",
    "age": 36,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at home with my family.  My oldest sister was the only one who had any interest in the new millennium.  She would talk about Y2k, but I didn't really get it.",
    "age": 24,
    "score": 2,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was DJing a party out in the suburbs. It was such a good time. I was so confident in my DJing skills and my appearance. Was with other fellow DJs and close friends.",
    "age": 36,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was with my family and extended family members. We celebrated New Year's Eve at my Grandparent's house. I remember I was playing video games with my cousins. The house was busy with people just enjoying themselves. A few minutes before midnight we tuned into Dick Clark's New Years Eve event and we waited for the ball to drop. I remember feeling really happy being around my family. Fast forward 16 years later, about a third of them are already gone. So my childhood memories mean a lot to me.",
    "age": 29,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "The town I grew up in had a \"first night\" celebration, which was a large new years eve celebration that happened downtown. There would be various events and vendors, and it would culminate with a ball drop ceremony. I was at the first night celebration with my parents, brother, and two sisters on New  Years Eve, 1999.",
    "age": 30,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember being in bed and my mom was tucking me in. We heard fireworks from the window and she told me it was now 2000. I fell asleep right after the fireworks.",
    "age": 23,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I just remember all the y2k stuff. I would have been 14 so I was paying attention, but not alot, I was too young to be out that late with friends so I know I was at home with my family and I do believe I stayed up until at least midnight but I dont remember a lot of details from the night. I know there was alot of hype surrounding the potential for problems when the year 2000 started. Its insane to think about it now, like we were scared of technology and its potential just 16 years ago and now it rules every moment of our lives, its like how people were in the early part of the 20th century. thinking we would all be in flying cars by now.",
    "age": 30,
    "score": 8,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 48,
    "score": 8,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I stayed up with my family watching a countdown on TV and to look and see if anyone in the neighborhood would set off fireworks. We also had our yearly special New Years Eve dinner. We were also wondering if something bad would happen from Y2K.",
    "age": 29,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was 18 years old. I was in my bedroom with my boyfriend drinking liquor that we stole from his mom's house. We made jokes about the lights going out because of Y2K. We were watching some movies before that point, I think it was The Faculty. We were really excited but also a little sad to see the 90s and last decade go.",
    "age": 35,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was 19 years old and spending the New years eve with my first (ex) husband. The general mood of that evening was sadness and hopelessness. My ex was abusive  and was like a ticking bomb waiting to explode, we lived with my in-laws who were very negative as well. They locked themselves up in their bedroom in order not to socialize with us. It was a super cold nigh in New York city, most people stayed in, fearful that something horrible might happen as the 2000 comes in. I felt down and afraid as well. My ex wanted us to go outside and try to see a movie. I got dressed in my warm fur coat and we went to roam the empty streets of Brooklyn, Kings Highway. The area was dark and deserted, everything was shut down, including the movies. After roaming around in the freezing cold for about 35 minutes we went back home. My ex started to fight, I cried and went to bed. I pretended to sleep while he watched the ball drop on TV.",
    "age": 36,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i had a newborn so was sleeping early with her",
    "age": 39,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I didn't do anything special on the night of New Year's Eve in 1999. I just stayed home with family and watched the ball drop on TV. It wasn't very exciting.",
    "age": 30,
    "score": 8,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at home for my winter break. I went out for dinner with my mom and sister and we got back to the house at around 10 pm. I went up to my room and listen to some music while talking to my friends online. Then around 11 pm I went downstairs and watch the New Year celebration on tv with my mom and sister.  We watched the ball drop in Time Square on tv and made a toast with our sparkling grape juice and champagne. I went to bed afterward I think because I was tired. It didn't feel any different than other New Year's Eve except maybe I was a bit wary about the Millennium bug for computer systems. I remembered thinking about that because it was all over the news but I wasn't particularly worried.",
    "age": 36,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "It was probably a typical new years for me hanging out with friends and waiting for it",
    "age": 27,
    "score": 4,
    "flashbulb": "FALSE"
  },
  {
    "memory": "My memory was probably much worse than other peoples'. I did not get to go to any parties or have any fun. I worked for an enormous credit card company and we had spent the entire year preparing for the turn of the century. I was stuck in my house with a laptop hooked up to my work environment and I had to help monitor the running of daily processing jobs to make sure the change of centuries did not cause any issues. My young children and my husband were there and we all talked about the change of the century and watched movies, played games, ate pizza and popcorn, and tried to have a good time despite my work obligations.",
    "age": 49,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i was only 10 so i played video games with my sister until the ball was about to drop then watched that then went back to game.",
    "age": 26,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "Me and at least one friend of mine decided to do the local \"First Night\" city wide celebration. We mostly spent the evening downtown. There were a lot of people around. I was bored after about 1030 and wanted to go home. I remember it being dark and cold and wishing that I was in a much bigger city where it was warm. I remember feeling annoyed that the tickets to the First Night were so expensive. I think the local peace center had a illuminated peace sign that night in a local park downtown. I don't remember much else.",
    "age": 35,
    "score": 7,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I guess I was hang out with my friends an that day and having some drinking",
    "age": 30,
    "score": 3,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I guess in 1999 New Year's Eve I was hang out with friends and having a dinner",
    "age": "",
    "score": 3,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I thought the world might end because of Y2K.  I was in my bedroom and my brother and mother were asleep in my room.  I was watching a countdown on TV wondering if anything might happen.",
    "age": 29,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I recall watching the fireworks from our screened-in back porch with my mom. I think my dad had already went to bed. My brother wanted to try to stay up but he also didn't make it and fell asleep early. Anyway, we could see the fireworks from our city's downtown through the woods above the tree line in our backyard. It was really fun to stay up with my mom since I was still pretty young.",
    "age": 24,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i was at a party with lots of drugs and alcohol. we all did acid and tripped out throughout the night with lots of beer, wine, liqour, and probably had sex too but really cant recall although i know that some of my friends did.",
    "age": 35,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 30,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was home with my husband. He had just gotten out of the hospital the day before,after cancer surgery. We sat up to watch the ball drop,and went to sleep right after,on the sectional couch we had at the time",
    "age": 57,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was 11 and my mom had just gotten eye surgery, so she went to bed early while I stayed up and watched the Disney Channel, because they were having NYE specials all night long. I didn't really think the world would end, but I was a little nervous anyway and I kept looking around to make sure things weren't going crazy.",
    "age": 28,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "My wife and I was watching the New York new years eve party on TV and was making fun of the world coming to an end like some people were afraid of. We were happy because we had a good year and we were saying now that we are doing pretty good the world will come to an end just our luck.",
    "age": 63,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i was 10 so i dont remember much. i know that everyone was worried about y2k",
    "age": 26,
    "score": 10,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was at home watching TV with my family and eating snacks.",
    "age": 32,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was 11 and hanging out with my brother and cousins eating tons of sugary candy. Our parents and grandparents were hanging out in the basement and drinking. We counted down to midnight and waited for the Y2K to hit, but of course nothing happened and we went to bed.",
    "age": 28,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I recalling watching the Times Square broadcast on TV with my parents and older brother. I remember being nervous about the Y2K thing, but nothing happened.",
    "age": 29,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was with my dad and his wife at his best friend's house. There was a lot of good food and fun. I remember we were supposed to watch The Mummy but there was something wrong with the dvd. It was very pixelated and kept skipping. I remember getting kind of bored because there weren't really any other kids there.",
    "age": 28,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 27,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I know that I was with my parents and that they had me stay up for the midnight ball drop but other than that I don't really know much of what was going on or what was happening.  I think I was also too young to really appreciate was was going on or the significance of the event.  I also know that my siblings were around but probably were not involved much because they were even younger than I was.",
    "age": 22,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I remember watching the news and Putin came to power. We were watching Lock, Stock and Two Smoking Barrels. Some friends I hadn't seen since the summer showed up. We started drinking. I found a girl in my bed when I went there around 2am. I was in Denmark.",
    "age": 45,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I spent the night in a hotel with my sister and some friends. We didn't go anywhere, since my sister was still under 21, but we had some drinks and a small party in the hotel room. Nothing too wild.",
    "age": 38,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 33,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I don't remember much at all. I only know that I was probably celebrating in MA or NH and I was probably with my ex from back then.",
    "age": 42,
    "score": 2,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I remember there was the Y2K scare and just a whole general millenium dooms-day scare but I got the impression most people were taking it as seriously as a horror movie.",
    "age": 31,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was standing outside our new apartment in a small town in arkansas, with my new husband. I was 20 years old. We just stood there in the cold night air, talking about how we'd always thought we'd be doing something so much more significant on that night.",
    "age": 36,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i remember being with my girlfriend, her two preteen daughters, her grown daughter and husband. we were at my house watching new year's festivities on tv....what stands out is how paranoid they all were about gunshots and staying inside in order to avoid falling bullets.",
    "age": 63,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember this year vividly because it was the year that Y2K was supposed to happen, and it didn't.  I remember spending that evening with my mother, because I had only moved to California recently and didn't have any friends yet.  It was the most uneventful New Years of my life.  I remember kind of waiting to see if everything would turn off or not, but I didn't think that it would, anyway.  I remember the experts saying it wouldn't happen and they were prepared, but I had that kind of \"what if?\" feeling about it.  But, nothing happened and I just watched the ball drop on TV with my mom.",
    "age": 34,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at work in a restaurant. I remember watching the ball come down on the TV over the bar. I had a bet with a co-worker that computers wouldn't run amok when midnight struck because of the year Y2K bug. One of my customers went into labor that night.",
    "age": 62,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I had just turned 20, and my cousin (not by blood) and I went to our mutual friend's house. He was about 30 and had his own place. Most of our acquaintances were also friends with him, so we all hung out there on weekends, and went to his place for NYE. We always hung out in his sunporch, which was divided into two rooms with a stair in the middle. The other room had a tv, the room we were in had all of the talkers. I vaguely remember sparkling cider (most of us were underage and half were religious). We spent most of the night joking about the coming apocalypse, but still watched the lights nervously during the countdown.\n\nAbout 2 minutes after midnight, a few of us decided it would be a lark to go see if the rest of the world still existed. So about 5 of us piled into someone's Jeep (Actually, James had a GeoTracker, and it might have been that), and took off for the nearest ATM. It was dark and quiet- almost no cars on the road, which was a little spooky for only being midnight. When we got to the ATM, IT ACTUALLY DIDN'T WORK. We were pretty much all \"whoah\" for the rest of the night. Pretty sure that it was a fluke, but not 100% sure. The next day, we heard that \"some\" banks were down as they did the changeover, so if we'd have gone back and hour later, it probably would have been fine.",
    "age": 36,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i was with my immediate family in the basement watching fireworks from down the street",
    "age": 25,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "In 1999 my youngest was 12. By this time in our lives we no longer went out for New Years Eve. So I can safely say I spent the evening at home and was in bed fast a sleep by the time midnight rolled around.",
    "age": 54,
    "score": 8,
    "flashbulb": "FALSE"
  },
  {
    "memory": "My memory of that night is very vague and the details are scarce, as would be my memory of any given New Year's Eve, as we don't usually hold or go to any parties. I remember the sense of anticipation leading up to it due to all the people being paranoid about Y2K, but I myself never felt any such fears. I have a vivid memory of -a- New Year's Eve, which I think may very well have been that night. My two cousins came over and spent the night. We played the first Medal of Honor game on my Playstation and ate some of the snacks my mom had put out for us. When midnight came, we took pots and pans and banged them together because an older cousin (not one of the ones there) had once told me that's what you were supposed to do. I'm about 85% certain this memory is from New Year's Eve 1999, but I hope you understand it's very difficult to know that for certain, and that's really the only stand out memory of any New Year's Eve I have.",
    "age": 28,
    "score": 6,
    "flashbulb": "FALSE"
  },
  {
    "memory": "From what I can recall of my New Years of 1999, I had a descent time. I was 20 years old, so it was still illegal to drink. That did not matter due to me being with older friends. We were in a local pub for the entire evening. I was with an old friend named Marvin(who has since passed away) and we had an amazing night. I do not recall what I was wearing even a little bit. As soon as the ball dropped, we all took shots of Yagermeister with red bull. From that point on, the rest of the night was a blur due to the excessive drinking.",
    "age": 37,
    "score": 7,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was an awkward teen that stayed home by myself on New Years, I probably just watched TV and went to bed before 1 am.",
    "age": 31,
    "score": 9,
    "flashbulb": ""
  },
  {
    "memory": "I was at home with my significant other. We were watching TV and doing other leisurely things in our home. Some of our friends went to parties. Many people were worried about Y2K. We were watching all of the other countries celebrate on TV, and everything looked the same as all the previous years. It became clear that Y2K was not going to be an issue. It was neat to be alive during the turn of the century, but it really wasn't that different from the past years after the night was over.",
    "age": 36,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i remember we were all gathered at a friends house. there was some talk about the rumors but for the most part everyone was having a great time and looking forward to midnight.",
    "age": 35,
    "score": 7,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was with a friend and we were watching the celebration and had a great time eating junk food",
    "age": 26,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "We had set up a big spread of food likes ribs, cheesy potatoes, pickles, veggies, fruits, pasta salad, and great desserts. We then watched movies we weren't allowed to normally watch till about 11:45 and then we waited for the ball to drop.",
    "age": 28,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was pretty young and with my brother, sister, Mom and Dad. We stayed up to wait for midnight and was watching the ball drop on TV. We had little poppers and snacks and stuff. We all thought it was just gonna be another day but there was a neighbour that was really anxious about it and they had stocked up on canned food, gas, generators, etc.",
    "age": 24,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i was home with my wife and dog, watching the festivities on tv. my wife was a sleep ' my dog was asleep' . i was dressed for bed and in a good mood' we had just eat a bunch of snacks befor my wife fell asleep.  i wanted to see if anything would happen' but everyting was fine.",
    "age": 66,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was sitting watching the time count down. It was channel 7 I believe. I was listening to prince's part like its 1999. The bro and his wife was in the other room on the computer watching a webcast. The kids were on the couch. Thats about all I remember.",
    "age": 29,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was with my mom, step dad, and step brother. we were at home watching the ball drop on TV. I don't remember what we were wearing or anything like that but after the show was over my step brother and I had to go to sleep.",
    "age": 22,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "My husband, my younger brother and me were playing cards at the kitchen table. We were playing Spades. There was a clock on the wall where we were watching the time tick by. The TV was on so we could here the New York Celebrations and the final countdown. This was memorable for me because it was Y2K. People mentioned that all electronics were gonna stop functioning and all that. As midnight struck, all of our stuff kept working. It did gives us a bit of anxiety waiting, but it was all good. We stopped playing cards shortly after that and went to bed.",
    "age": 43,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "My friend and I spent the evening at my parent's house.  My parents were out, so we were drinking a little and both smoked marijuana for the first time.  Neither of us was too concerned about Y2K or the End of the World or anything.  We just gorged on food and watched MTV's countdown.",
    "age": 32,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at my home with my parents and siblings. We watched some tv show for new year, had dinner and called relatives to wish them new year.",
    "age": 34,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at my parent's house in St. Louis with my brother and sister.  We were watching the New Year's celebrations from around the world on TV and as midnight approached we were watching the ball drop on TV.  We ate a buffet of different appetizers.",
    "age": 39,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember celebrating with my family and eating grapes",
    "age": 23,
    "score": 1,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was at my childhood home.  I was in university at the time but had gone home for Christmas.  My twin brother and parents were there, too.  My twin spent a lot of time watching the celebrations around the world during the day.  CNN was doing nearly 24 hours of coverage, I think, though obviously there were some large gaps as time zones went into the Pacific.  There was some tension and excitement I felt.  Part of me was hoping that Y2K would destroy the world and part of me didn't care.  But there was so much hype around Y2K that I wanted something to happen.  (I'm an asshole.)  Of course nothing did, which is what I expected.  I recall that as midnight approached for us on the west coast, I felt like the excitement had already gone out of the event.  Basically everyone else in the world was already in the year 2000 and nothing had gone wrong and of course nothing had changed.  Also, there was that inane conversation about how 2000 isn't actually the new millennium, since you don't start at year 0.  Even stupider was people who said it wasn't the new millennium but then still thought it was a new century.  Overall I thought New Year's was much like everything in our world: it just served to show me how stupid people are and how much I dislike them.",
    "age": 38,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "My wife and I we a bit concerned because of all of the Y2K concerns that had been in the news for nearly 2 years before that date.  We watch news a lot, and watched the New Year hit in Australia and other countries before it happened in the US.  We were interested if anything bad happened to those societies.  We watched the ball drop in real time which was at 10 PM in our time zone.  We stayed up in our living room until midnight.  We drank champagne.  We kissed.  We went outside to see any fireworks that were in the air.  We went to bed shortly after 12:30 AM",
    "age": 69,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at my grandparent's house with my mother and father. I was sitting with my mom and dad on the couch watching the ball drop in New York City, New York.",
    "age": 23,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was home with my parents, as usual. The only vivid memory I have is of watching the celebrations around the world on TV as they entered a new millennium. (Well, actually, that was a year later.) I remember the fireworks in London were particularly spectacular. \n\nI don't remember celebrating the new year. I don't even remember if I drank any alcohol. I remember going back to work the next day or two afterwards and thinking how it all was kind of a non-event. (The world didn't end, the computers still worked fine, etc.)",
    "age": 53,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember being nervous thinking the world would come to an end because of y2k",
    "age": 30,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "New years eve 1999, I was seven. I spent the night reading until I fell asleep. My parents didn't make a big deal over New Years.",
    "age": 23,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": "",
    "score": 1,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was at home with my 3 kids and everyone was freaked out about y2k. I only stayed up because I was scared everything was going to stop working since this was all the news for weeks before 2000",
    "age": 41,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I don't remember a single thing about it specifically. Only about the Y2K thing and that nothing happened when midnight hit. Other than that, nothing specific,.",
    "age": 41,
    "score": 1,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 34,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "It's pretty dim in my memory. Everyone was excited, sitting outside, waiting for the clock to hit midnight and the fireworks to go off. There was an air of anticipation and everyone talked as they waited.",
    "age": 26,
    "score": 8,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I think I remember watching TV until midnight or something.",
    "age": 29,
    "score": 4,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 55,
    "score": 3,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was probably at home with my husband and 2 young children, who were 3 and 1 1/2 at the time. Most likely, we were sleeping at midnight. We don't usually do anything to celebrate New Year's Eve.",
    "age": 53,
    "score": 3,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I remember I was with my new girlfriend. I was still very excited to be with her and remember my heart pounding every time she got close. We spent New Years together by ourselves..",
    "age": 38,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at a party a friend of mine was throwing on the neighborhood. I was just a kid then, so I had to sneak out of the house to attend the party. It was packed with all the kids from the neighborhood and from school. We drank alcohol and smoked some weed. We were only 14-16 years old at the time, so we knew doing that was a huge risk.",
    "age": 32,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "At the time my children were around 10 years old and my wife and I spent the evening at home with them as we normally did on New Year's Eve during this general time period. It was our tradition to all get in our hot tub on New Year's Eve and that is what we did. We usually spend an hour or two at the most in the hot tub and then got out and spent the time up until midnight watching TV programs related to the holiday. My wife had purchased party favors (hats, little horns, etc.) for the kids to use at midnight and that is how they rung in the new year and how they normally did around that time.",
    "age": 57,
    "score": 9,
    "flashbulb": "FALSE"
  },
  {
    "memory": "We were driving to ohio to see my husbands sister and her family.  I got pulled over in KY and got a speeding ticket.  We finally arrived at 11:30 and my sister in law had filled the bathtub in case we lost power or water.",
    "age": 34,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was having a party with family and friends. We were anticipating what would happen when midnight hit because of what the media said about computers.",
    "age": 39,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "It was our senior year of high school. My best friend's, Lindsay and Debbie, and I threw a party at Lindsay's house. It was a mixed boy/girl party because our friend group was 3 girls and 3 boys. There were extra people there but I don't remember specifically who. We played dance, dance revolution which had come out recently. We played twister. We watched the ball drop on TV. Lindsay and her boyfriend Adam kissed, which was a big deal to all of us at 17. Lindsay's parents had gotten us noise blowers and silly string that shot out of a can. Leading up to midnight there was a lot of talk about Y2K and how computers could all die or something. Our male friends were all into computer science. I didn't believe any of that would really matter but I do remember feeling a little anxious/excited about it because it was something out of the ordinary. Come midnight nothing happened. The only thing I remember from after midnight was pulling silly string off the window frames and thinking it was messy and that I'd never want to use it again just because of the cleanup.",
    "age": 34,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I believe I spent at at my step-mother's house at the time, with my father, stepmother, sister, and stepsisters, and that we ate some food and played some video games. I don't really remember much else, because it was so long ago, but it was a pretty pleasant memory in general.",
    "age": 26,
    "score": 9,
    "flashbulb": "FALSE"
  },
  {
    "memory": "My memory of New Year's Eve was very limited since I was only 11 at the time. I do remember being at the old house and having some friends over during the time. Not much otherwise.",
    "age": 26,
    "score": 8,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was with my family, we were having a new's year dinner and outside of our house in the porch, waiting to see the fireworks.",
    "age": 25,
    "score": 9,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was with my 19 year old daughter. Just like every year, we went to the Fireworks downtown.  We parked in the large parking lot next to the river.  They are the best of all the local town fireworks because they are right over everyone, set off over the river.  And the sounds bounce off the buildings.  We would get there a bit early so we could get a good spot.  And bring lawn chairs and snacks.",
    "age": 61,
    "score": 11,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was in the city of Knoxville in Tennessee with my girlfriend at the time -- I had gone back to Washington state to spend Christmas with my mother, but returned on New Years Eve to celebrate the New Year with her as a compromise for not spending Christmas with her and her family.  We intended to go out and do something, but she contracted influenza from someone at the holiday parties.  I spent New Years Eve with her, bringing her cups of herbal tea, and making sure the humidifier was topped off.  I also recall spending some time on IRC, to wish friends on the Internet a happy New Year as well towards midnight.  It was mostly uneventful.",
    "age": 36,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was working in a casino on the Las Vegas strip.  I had worked the late shift the night before and then the early shift on New Year's Eve so I was going on very little sleep.  The casino was incredibly busy as many people come to Vegas for New Year's.  It was a tough day at work with it being so busy and even though I was on the early shift most of our customers were already drunk.  After my shift ended it was a struggle just to get off the Vegas strip because it was so crowded.  I made it home finally and showered and had a quick dinner.  Then, because I was so exhausted I went to bed early that night and was sound asleep at midnight.",
    "age": 48,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i was with my parent hanging out with rest of my family staying up late and playing video games and eating junk food while we counted down the new year.",
    "age": 24,
    "score": 4,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was at home watching the ball drop on my tv with my mom and great grandma. I was excited to ring in the new year with them",
    "age": 27,
    "score": 7,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at a friends house as we threw a party to bring in the new century. One thing that was in the back of my mind was the whole y2K thing although other countries came out with no issues or very little earlier that day. I would say it was probably 30 of us all of which I had known as friends and very close friends. We drank the night away and had a blast! I was kind of hoping for the world to end, but it was a great night non the less.",
    "age": 35,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "It was a quiet night at home with my spouse.  We were together laughing, talking and drinking.  He fell asleep before midnight and I played the song 1999 and watched a New Year's show on tv.",
    "age": 44,
    "score": 7,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember I was 14 at the time and my family and I all went to my uncle's house to celebrate the coming new year. I remember there being an abundance of food like grilled chicken, pasta, and much more. I also remember all the adults being quite intoxicated at the time but overall it was a great time.",
    "age": 30,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I always spend New Years Eve at home. I love the holiday  because it is a time to relax after the Christmas rush. I make food all night and watch TV with my family. We wait for the ball to drop in Times Square. My oldest son was 14 and the other four - 12, 10, 8 and 2. I know that that year we did what we always do. There was more talk about whether things would change as the new century began. I know that the boys could not wait for midnight to come so they could see for themselves if things would stay the same.",
    "age": 57,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was about 12 at the time.  My mother was afraid because of all of the end of the world talk.  We went to church and prayed in the new year.  I found it very boring.",
    "age": 30,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "We were waiting for things to go wrong. That was when the Y2K thing was going on. Supposedly shit was going to go down and destroy everything like taking out lights and stuff. People were scared. People stockpiled food. My family did that haha.",
    "age": 30,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "On New Year's Eve 1999 I was with my husband and son at our friend's house. We were watching for the ball to drop in Timesquare on TV to see if the power would shut down. Everyone was worried about Y2K happening.",
    "age": 35,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 41,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was at home with my parents brothers and grandmother. We were watching movies all night then 30 minutes before midnight we switched to tv and watched Dick Clark talk. After the ball dropped we watched another movie and everyone fell asleep in the living room.",
    "age": 29,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 27,
    "score": 1,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was watching TV with my parents.  My brother was at a friend's party.  I was a bit worried about Y2K, but didn't think it would be a big deal overall.",
    "age": 35,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was at my girlfriends house, there were a few friends there and a couple people I had just met that night, about 10 people total.  Two friends were arguing.  I made burgers on the grill.",
    "age": 45,
    "score": 7,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i was young and watching new years eve on tv with my parents. we were in my living room. i only remember this year because of the Y2K scare",
    "age": 27,
    "score": 6,
    "flashbulb": "FALSE"
  },
  {
    "memory": "went to friends house",
    "age": 35,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "On new year's eve we went out in to the woods and had a big bonfire and did fireworks, rode atvs and dirtbikes.",
    "age": 29,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was sitting with my brother in a bedroom and we were watching the ball drop on television. I was very tired and my brother was talking about what would happen after midnight. I was generally silent and after the ball dropped we kind of said woo hoo its 2000 but that's pretty much it.",
    "age": 26,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was with my girlfriend at the time.  This was at a time when I was still in high school.  On New Year's Even 1999 I went to a party that I was invited to with my girlfriend.  I was with friends of her family and some people I knew, but mostly were strangers.  I remember begin especially excited that I was going to have the opportunity to do something that nobody for 1,000 years had got the chance to do and that's welcome in a new millennium.  I remember being anxious about the clock striking 12:00 because of all the talk of Y2K and how computer systems everywhere could be affected.  I didn't know if the electricity was going to go out but I remember thinking that could happen and I was preparing myself for that.  As the clock hit 12:00 I gave my girlfriend a kiss.  After the clock hit 12:00 I remember being surprised that nothing at all out of the ordinary seemed to happen.  Everyone at the party was cheering and celebrating the near year and millennium and everything seemed normal.  Y2K hadn't shown any signs of being real yet so the rest of the night went on like normal until the party was over and everyone left to go home.",
    "age": 31,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was in Lake Geneva with my best friend and a group of our mutual friends.  We weren't old enough to drink so we weren't doing any of that.  We did have some leftover fireworks from earlier that summer, so even though it was cold and snowy, we lit them off at midnight and then had some pizza and went inside to listen to music and just hang out.",
    "age": 30,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember waiting in my living room with my parents.  I think my siblings were out of the house at the time.  I was waiting to see if the world would actually end.  I prepared confetti for the occasion.",
    "age": 28,
    "score": 13,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I watched the ball drop on tv with my parents and siblings. We also would have looked out the window to see the fireworks from our city. I always had sparkling juice on New Year's Eve but I do not remember much specifically from that year.",
    "age": 28,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I THINK I WAS PLAYING WITH MY STUFF ANIMALS WITH MY BROTHER",
    "age": 19,
    "score": 5,
    "flashbulb": "FALSE"
  },
  {
    "memory": "In 1999, I would have wanted to be at a big party because of Prince's song 1999, but I wasn't. I stayed home that year and watched with my mom. I believe my sister was at home because she hurt her back. She was in bed the whole time. I had chips and dip with my mom, who watched until midnight and then went to sleep probably right after. I probably flipped channels a bit before going to sleep. There would have been fireworks going off.",
    "age": 41,
    "score": 11,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was with my friend and family. There were some family friends there aswell.. We all had a big pizza party and were excited to count down to 2000. Dad had all sorts of food and water stored just incase. When it was 12 we all screamed and were excited. Some people had a new years kiss and every on toasted.",
    "age": 23,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was 10 years old. I was wearing a burgundy colored velvet dress with black flats. My father had taken me out earlier in the day to take pictures at a duck feeding park near our home. My dad threw a huge party and some of his friends were there. Our neighbors were there with their kids, who were my friends. My dad played music from the 80's as everyone got drunk and popped balloons and watched the celebration in Times Square. I remember my dad putting on a funny wig at one point and one of the neighbors stealing a bottle of liquor. At midnight we watched the ball drop on tv and then went outside to set off fireworks and watch my dad's fireworks display he had rigged up. I remember being afraid that something bad was going to happen, but when nothing bad did happen I went to bed.",
    "age": 27,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "i was in tempe, az and visiting family for the holidays. we went to the stadium there where music was playing and the fireworks started after the countdown. it was mildly cool that night. then it got chaotic as a riot erupted, the first i've ever been in the center of. we had to get away quickly as people started fires, flipped cars, and police helicopters swarmed overhead. it was really exciting.",
    "age": 32,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I with with all of my family members. Parents, sisters, Aunt and Uncles, and cousins.",
    "age": 23,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I worked late that night then i was asleep when midnight came",
    "age": 35,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was alone in my apartment, thinking about the previous years, and thinking about what could lie ahead for me. Moments of reflection, wishing things were better, thankful that things weren't worse.",
    "age": 49,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was 10 years old and I thought the world was going to end because my friends at school kept saying that was going to happen. I wasn't to happy and my brothers and mother tried to be positive about the situation. I only remember we were at home and when midnight struck mom and dad gave us hugs and kisses and welcomed us to the new year.",
    "age": 27,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "It was a quaint get together with my husband, friend and then 3 year old.  We watched the NYE coverage, we were just about to start our company and were still ironing out the details.  We were also a little nervous in regards to Y2K for the most part our spirits were very high as we were starting our start-up, and about to start the new year.  It was very exciting.",
    "age": 39,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "my husband, daughter, and i were enjoying a nice quiet evening at home. we went to bed early. we didn't have a new year's eve party.",
    "age": 40,
    "score": 10,
    "flashbulb": "FALSE"
  },
  {
    "memory": "we were on cruise with my husband. It was a great New Year's Eve",
    "age": 42,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "We spend the day, evening/night with family. I remember playing with my cousins and alone.",
    "age": 25,
    "score": 8,
    "flashbulb": "FALSE"
  },
  {
    "memory": "All I can remember is I was a junior in high school and there was all of this talk of Y2K and the end of the world.  I stayed up until midnight.  I was curious as to what would happen, if anything when it changed to the year 2000.  I was with my family on that night.  I was with my mom, and my brother and sister.  I remember wondering what would happen to the computers because there was speculation that computers wouldn't work anymore.  The new year came and it was like any other new year, nothing changed except that it was a new year.  It wasn't the end of the world, the computer still worked, and life went on as normal.",
    "age": 33,
    "score": 8,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I had two very young children so my husband and I stayed home.  I remember watching a football game on television and talking,playing with the kids.",
    "age": 46,
    "score": 9,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was 11 years old and I remember I was nervous about Y2K. I remember as soon as it hit midnight I ran to look outside to see if anything had changed and I hit my shin on a big globe on our living room floor. It hit the wall and my moms said something like \"Jesus Ashley calm down!\" and I laughed and looked outside and nothing had changed",
    "age": 27,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "It was my first year in college but came home for the holidays. I went to a friend's house on a lake. He had a party with about 20 people and watched fireworks at night. We had a bonfire and drank alcohol until and after midnight. It was informal and a relaxed atmosphere.",
    "age": 35,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 29,
    "score": 3,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was only 5 years old at the time, but I remember it being a big family event. My uncle threw a party at his house and a lot of our family went there. It was similar to the usual new year's party, with drinking for the adults while the kids run around doing whatever. It was a fun, but simple time. Many of the parents were slightly worried about the whole y2k thing, but no one took it extremely seriously.",
    "age": 21,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I mainly remember all the discussion about the Y2K bug and a lot of people waiting to see if the entire electrical grid, stock market, internet etc. would collapse",
    "age": 35,
    "score": 9,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I remember watching the ball drop with my family in the living room.",
    "age": 26,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was sitting in my room playing StarCraft with my friends while my dad was outside watching TV.",
    "age": 33,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I went to a party at a friends house who lived a few houses down from me.  Most people were drinking a LOT of Everclear.  I didn't drink at all, but I smoked a half ounce of marijuana by myself in a few hours.  When it was midnight we all watched the celebration on MTV and waited for the computers to destroy the world.  Nothing happened, so I walked back to my house around 1-2 am and went to bed.  I was 17 at the time.",
    "age": 33,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "It was very exciting. Although I was young I still remember the significance of a new millennium. I was also a little nervous about the Y2K bug, not terrified.",
    "age": 25,
    "score": 11,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 32,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was at a party at my friend's house in Williamburg Brooklyn. My girlfriend and I had taken a priceline flight that only arrived in NYC around 10:30pm.",
    "age": 45,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I was ten years old watching the ball drop on TV. The only other person there was my mom who was clearly exhausted because it's way later than she normally stayed up. I was very excited to get to stay up so late, however. For some reason I remember eating Chex Mix as well and declaring that it was the first food of the new millennium.",
    "age": 26,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember mostly the craze surrounding Y2K and the fear that the computers would stop working at midnight and people stocking up on supplies and bottled water. I believe I was home watching the ball drop on TV.",
    "age": 32,
    "score": 6,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I remember being with my boyfriend at the time. We were both heading to a party with some close friends and family. In the back of my head, I was thinking it could be the \"End of the world\", but it was not an overwhelmingly convincing thought. We enjoyed the night and celebrated.",
    "age": 35,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "Dont really remember that much since I was 11. I was celebrating with my family and family friends",
    "age": 27,
    "score": 9,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I was in Chicago with friends and family",
    "age": 27,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 28,
    "score": 2,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I remember me and my parents were all sitting in the living room. We were all waiting for the ball to drop on TV. When the ball dropped, we all cheered.",
    "age": 27,
    "score": 16,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember everyone being worried about Y2K and thinking the earth would be in a huge global blackout because of the Y2K bug.",
    "age": 32,
    "score": 14,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 33,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "i have no specific memories.  I'm sure I was with my wife, and normally we don't go out on New Year's eve.  We were probably at home watching countdowns on TV.",
    "age": 47,
    "score": 3,
    "flashbulb": "FALSE"
  },
  {
    "memory": "My wife called to tell me that she was going out with work friends for new years eve. I was left home alone. I watched the ball drop with my two cats. I was actually pretty depressed at the time. I vividly remembering watch the Evil Dead trilogy on VHS afterward while drinking a bottle of vodka.",
    "age": 39,
    "score": 17,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I remember it was funny, because people were joking about the year. I was too young to have too much fun, so I just stayed at home.",
    "age": 34,
    "score": 7,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I lived in Indiana at the time but I came down to Florida and spent it with my family. We went to the home of one of my uncles coworkers.",
    "age": 34,
    "score": 8,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 25,
    "score": 2,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I remember being with my husband at home. That is it.",
    "age": 38,
    "score": 7,
    "flashbulb": "FALSE"
  },
  {
    "memory": "I picked up a shift in valet parking at my mother's place of work (a swanky country club). The rich people were having a big party and it was a really different atmosphere from what I was used to.",
    "age": 39,
    "score": 15,
    "flashbulb": "TRUE"
  },
  {
    "memory": "A tuxedo because I was at a family wedding.",
    "age": 28,
    "score": 12,
    "flashbulb": "TRUE"
  },
  {
    "memory": "I have no memory of it anymore.",
    "age": 30,
    "score": 3,
    "flashbulb": "FALSE"
  },
  {
    "memory": "i was at a parents friends house, with a bunch of adults",
    "age": 25,
    "score": 10,
    "flashbulb": "TRUE"
  },
  {
    "memory": "",
    "age": 33,
    "score": 0,
    "flashbulb": "FALSE"
  },
  {
    "memory": "",
    "age": 24,
    "score": 0,
    "flashbulb": "FALSE"
  }
]