  [
  {
    "first": "Sharonda",
    "last": "Arnold",
    "age": 32,
    "residence": "Durham, NC",
    "occupation": "Not Specified",
    "interviewLocation":"Durham Bus Station",
    "interviewDate":"July 28, 2016",
    "duration": "7:03",
    "summary": "I remember people saying that this is the year that the Lord is gonna come. I’m a young girl, so I’m like, “Oh, I want to live my life! I want to live my life!'",
    "transcript":"Arnold, Sharonda_072816.pdf",
    "audio":"Arnold_compressed.mp3",
    "text": "So I’ve already told you a little about what this about without saying too much. So 1999 becomes the year 2000. New Year’s Eve. Put my on that day. Tell me what you remember. So 1999… New Year’s Eve before the year 2K. I remember people pulling their money out of the bank. [laughs] And they said that the banks were not going to understand what year it was. So the money is gonna get lost. I remember people being very afraid. The biggest thing was people thought that either that either the banks were gonna crash or the world was gonna end in 2000 [laughs] So yeah, I just remember a lot of people being afraid and uncertain as to what the year 2000 was going to bring. My father himself he pulled out like all of his money out of the bank, except about a thousand dollars. Wow. Yeah. So what did he do with it, keep it in the house? SA: He just kept it in the house [laughs]. He was convinced that something…because everybody was talking about it. He was convinced that his money could potentially get lost. Do you remember how he felt the next day? [laughs] No, I don’t. I don’t. I just remember the conversation. I just remember the conversation before. So you were in high school then? Yes, ’99… I was born in ’83, so yeah. So do you remember what you were doing that night? Um. I believe that I was just in the house. I was actually afraid, too, because everybody was saying it was so uncertain what was going to happen in the next year. I wasn’t convinced that it was going to be like, this big, like shut down in the banks and the markets, I just was a little fearful because everybody else was. Well, when your dad is taking out all of his money…Yeah [laughs]. So, that was my experience. But then, when we woke up and the year 2000 was here, and nothing was wrong, I was like [Sharonda makes an exaggerated sound of relief] 'Woo.' [laughs hard]. Do you remember other New Years, like before then? I’m just trying to get a frame of reference? To see if you remember that one a lot better than the other ones? Yeah, definitely. I remember that one because everybody was scared that year. I mean, the other ones that I would potentially remember are because I was doing something amazing like bringing it in. But other than that, I don’t have a real vivid picture of the New Years from, you know, ninety….That is my most vivid New Year.Do you remember, was it only because of the Y2K bug, or do you remember people thinking, like, for religious reasons or whatever, that the world might end at that time? Sharonda’s eyes light up in surprise, as if she has just remembered something that she had long forgotten.Yes! Yes. Tell me about that. I just remember like people saying that this is the year that the Lord is gonna come. You know, I’m a young girl, so I’m like [high-pitched, pleading voice] “Oh, I want to live my life! I want to live my life.” But I just remember in the churches, they were…the message that they were preaching is that God is coming back. So I remember being very afraid, like 'Oh my God. It’s gonna be 2000…' Now, they were saying this at your church? No, no, just in churches in general. Like, God is coming back. They weren’t saying that in the year 2000 was coming, that he was coming back. But they were saying that God was coming back, so that was the message that was preached in 1999. So I was under the assumption with that being the message that was preached, that in 2000 that’s what was going to happen. So it was just scary. [laughs hard] And then relief, right? Yeah. It was scary, and then relief, in the year…yeah. So let me ask you this. If a young kid came up to you right now, who was too young to remember that time at all, and said, “What was life like in 1999?” What would you tell him or her? In 1999, for me, it was…you know, I was still in high school, so it was really fun for me. Toward the end of 1999, it was scary because everybody had evoked fear in everybody, whether it was the fear of the markets were gonna crash, or it was the fear that all of your money was gonna get lost in the banks, or the fear that, you know, it was…that the world was coming to an end. [laughs] Do you remember, because that was really when the internet was starting to take off, cell phones came out, do you remember when you had your first experiences with that kind of stuff? Like, sending emails, or getting a cell phone? Um, I remember when I got my first cell phone. It was my freshman year in college. And I remember, in my freshman year in college, which was a few years later, in 2001, but I remember the first time that I actually saw somebody with a cell phone in their car. [laughs]. It was humungous. No, it was, it wasn’t just…My father had a phone in the car that was like, it was a big phone. But It didn’t work. But the first time I actually saw somebody riding in the car talking on the phone, it was like a really huge phone. And I was like, “Oh my god, why does he have that cordless house phone on his head?” [laugh] Cordless house phone. This cordless house phone on his head. But yeah, that was…yeah. What about the internet? Because you were in college right when that – Right. So, no, we had internet prior to college, but what I remember most is AOL. The [Sharonda imitates the sound of a modem] 'EHHHHHH!' [laughs hard] So yeah, I didn’t really start sending emails until I got to college in 2001. But I do remember going on the internet and really being amazed at how I could just search for anything. You’re like the third person, that when they’re sharing their memories, has made that sound. Sharonda laughs. Really? And I’ve gotten a couple of people that have said, “You’ve got mail.” [laughs] Yeah, that was it. That was it, that was it. Yeah, yeah. It’s funny, that like you probably can’t remember names, dates, or anything, but you remember that sound. Because it meant, “Hey, good, I’m on now, finally.” Yeah, it did. It did. “You’ve got mail.” And I still have my AOL account, and people are like [mocking voice] “You still use AOL?” You still use the email address? Well, I still have my email address and I still use it sometimes. I use it when I’m like signing up for those seven days, de-cluttering your life, I use that email address. People are like, “Wow! This is from the 90s! Are we gonna get a Bell Biv DeVoe song next?” Yeah. And then they say, “You know that AOL has issues with people, you know, breaking in…it’s not as secure as Gmail.” So they’re like, “I’m not sending you anything to that email account."
  },
   {
    "first": "Needham",
    "last": "Bass",
    "age": 64,
    "residence": "Durham, NC",
    "occupation": "Sales and Marketing Executive",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "8:58",
    "summary": "I remember very vividly, being part of history. I thought, 'I’m going to be one of the few people that was born almost in the middle of the last century and with some luck I might make it close to the middle of this century. And that’s a unique group to be in.'",
    "transcript":"Bass, Needham_073016.pdf",
    "audio":"Bass_compressed.mp3",
    "text": "So you’ve seen the sign and it piqued your curiosity, hopefully. This is called the Millennium Memory Project. It’s trying to get a better understanding of people’s memories from he turn of the millennium. So let’s just start on a personal level. Walk me back to that day and tell me what you remember about it. I remember worrying about whether the computers were going to default because of the date situation. I mean, we’d spent a whole week prior to that getting everything ready, and trying to archive things, going through all kinds of stupid procedures, which turned out to be a whole lot to do about nothing. And I also remember very vividly, being part of history. I mean, when you’re in your 20 and 30s, you don’t really think about turning into a new millennium, and then, I thought, when it happened, I thought, “I’m going to be one of the few people that was born almost in the middle of the last century and with some luck I might make it close to the middle of this century. And that’s a unique group to be in.” And the actual day, my wife and I were glued to the TV -- I can’t remember which channel it was -- but they covered celebrations, starting in Australia, going around the world. So we spent almost 24 hours enjoying the turn, and the most moving one was the Aborigines celebrating it in Australia. Needham begins to cry. I didn’t know this was going to make me feel like this. So…it was just so moving to see all these different cultures celebrate something that really is a turning point in history. Because we’re not going to live to see another one. There may be some of us out here, but I won’t. I’m glad I was able to enjoy this one. And when midnight approached, do you remember that vividly? Um, I remember kissing my wife [laugh]. And drinking champagne; real fine, French champagne.You already said this, but I just wanted to clarify: You were living in Durham at the time, right? Yep. What were you doing for a living then? I am in sales and marketing for independent grocery stores. Everybody was worried that all of their cash registers and anything that was connected to computers was going to default. People don’t really realize how many people were worried about that. People thought coffee-making machines and everything were going to default, and I don’t think a single thing did [laughs]. Which is kind of silly. It’s not silly at all, and you’re probably…nine out of ten people, that’s been the salient memory that came from that. Now, you mentioned the sense that you felt privileged to have reached that milestone. What about it, other than the date changing, made it seem so special? Well, you start thinking about, you’re part of history. There’s only certain number of people that are able to live in this. And it’s all happenstance of when you’re born. And there is a definite change between this century and the last century. Living in the 20th century, as progressive as people were, no one ever thought that a black man would ever become the president of the United States. And lo and behold, eight years later, things changed. And that’s just one of the things. No one would have ever thought that people would be accepting of people of different sexual orientations. And now, it’s passé. I mean, people are much more open, and it’s not to say everything is great, but I do think there’s just something about turning into the new century, that maybe people opened their minds just a bit, and became a little more accepting and open about the fact that we’re progressing. And we should progress. So you feel things have gotten better since then? Yes, but I’m not wearing rose-colored glasses. They’re not anywhere near where they should be. Everybody kicks and screams when changes come. But I do think the 21st century is the 21st century; it’s not the 20th. So do you think -- and you’ve touched on this -- but do you think the fact that it changed to a new millennium precipitated this change to some degree, or this would have, could have, happened at another point in history? That’s a tough question. I don’t know. I would like to think that maybe there’s just something about human nature that when we pass milestones, we get a little more open-minded, but who’s to say? So take me back – and this will be the last question – walk me through a day in 1999 and compare it to now, as far as technology, and your daily life, how it’s changed. Well, in 1999, you thought things were really, really advanced, but computers are so much faster…I mean, there’s more computing power in a smart phone than there was in the computer I was using in my business, and I was managing close to $2 million everyday. You look back on it, and I think, “Gee whiz, it’s so antiquated.” You know, we did very little on the Internet. It was just a novelty at that time, or nothing like it is.In your line of work, is that when things sort of – the fulcrum point – is that when things changed toward Internet-based? Yeah. I mean, I used to go out and drive miles to see people, and now, it’s a click of a button, and it’s like you’re sitting there with them. And everybody is so dependent on it. That’s what they want you to do. When you actually have to go see them face-to-face, it’s a novelty. They enjoy it, and I enjoy it, but it’s basically a waste of time. Do you think it attracts different people in that line of work now? Um, it does. And that has some good sides and some bad sides. At least in my line of business, you’ve got people that are very smart, but they haven’t had the actual physical contact with what my job entails. And sometimes they know the technology, but they don’t know the nuts and bolts of what it actually is. But you know, I’m on the end of my career, and I’ll let the next crowd figure it out. Last question: you got emotional there. You don’t have to pick any wounds; I certainly don’t want you to. But why do you think you got emotional about it? Well, it’s not picking…there’s no wounds to pick. Okay, I wasn’t sure. I did get very emotional, close to crying, and I think it’s because, you know, I won’t live to see the next one. I wish I could. And if I do, by some chance, live that long...That’ll be another conversation, right there. [laugh] [laugh] I probably won’t be aware of it. But you know, I lived at a certain point in history that I own. And it’s something that I can talk about, and as long as I have a memory, I can talk about the memories of it. So it is kind of emotional. Well said."
  },
     {
    "first": "Sadie",
    "last": "Bower",
    "age": 41,
    "residence": "Carrboro, NC",
    "occupation": "Not Specified",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "2:46",
    "summary": "We went into a diner, and we had pancakes and 2:00 am. And we watched the street cleaners pick up all of the confetti, and in fact, the world had not come to an end, and everybody was still around, and Times Square was still cooking.",
    "transcript":"Bower, Sadie_080616.pdf",
    "audio":"Bower_compressed.mp3",
    "text": "So take a minute to think about that, New Year’s Eve 1999, going into the [booming voice] year 2000. Paint a picture for us. What do you remember? I lived in New York City. I know. It was not as glamorous as you think it would be, though. Why do you say that? I had some friends visiting and we went down to Times Square, but not at midnight, after midnight. And… That had to be a weird scene. It was pretty weird, actually. There was confetti everywhere, and there was trash all over the streets. And we went into a diner, and we had pancakes and 2:00 am. And we watched the street cleaners pick up all of the confetti, and in fact, the world had not come to an end, and everybody was still around, and Times Square was still cooking, and that’s pretty much what I remember. Now, you can be honest. Did you really think something might happen? No. I didn’t actually think anything would happen. So you didn’t take any preparations for the Y2K bug? I didn’t, but I’m not terribly tech-savvy, so I wouldn’t have known what to do, had I been worried about it [laughs]. Yeah. No, I mean, I’ve had conversations with people that took all their money out of the bank, and all sorts of...Wow. Oh yeah. Yeah, no, I did not do any of that. I guess I would have been out of luck had my bank account shut down [laughs]. Or any of that not work. Besides the Y2K, did it seem important to you? Well, it seemed lucky to be alive at a turning point in history. And it seemed cool and interesting. But it didn’t seem important in terms of the computers and the things that people were focusing on. It seemed historical. Interesting. “Lucky to be alive,” you’re not the first person to say that. Okay. And this, like I said, is for kind of a time capsule, so you never know who is going to listen to it down the road. Let me ask you this: What will people be talking about in the year 2100? Oh, wow. Let’s see, what will they be talking about...Most often.Hmm. Climate change. [laughs] For better or for worse? I’m hoping for better, but I fear for worse. Yeah. Yeah. Well, hopefully, the archive will be around, meaning that things haven’t totally gone down the toilet.Yes, that’s right. Hopefully they’ll have a really cool way of listening to it. Yeah. [laughs]."
  }
]